АлогистикТест2/src/Documents/алк_Аддендумы/алк_Аддендумы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_Аддендумы</name>
  <comment>Уточнение договора на поставку товаров клиенту</comment>
  <registerRecords>AccumulationRegister.алк_Аддендумы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_СтатусыАддендума</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУсловийПоставки</name>
    <type>
      <types>CatalogRef.алк_УсловияПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАддендума</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАддендума</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияЗапрещены</name>
    <comment>Устанавливают после регистрации в ЛесЕГАИС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаРазрешена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>127</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеВручную</name>
      <comment>Если Да - пользователь вводит руками, если нет - перезаполняется по нашим алгоритмам</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияПЭО</name>
      <type>
        <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставТоваров</name>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаОт</name>
      <comment>Длина в миллиметрах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаДо</name>
      <comment>Длина в миллиметрах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВлажностьОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВлажностьДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПрипуска</name>
      <type>
        <types>CatalogRef.алк_ВариантыПрипуска</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_Аддендумы/алк_Аддендумы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_Аддендумы</name>
  <comment>Регистр показывает сколько требуется произвести и отгрузить по заказу</comment>
  <resources>
    <name>КПроизводству</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </resources>
  <resources>
    <name>Произведено</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Аддендум</name>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Enums/алк_СтатусыАддендума/алк_СтатусыАддендума.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_СтатусыАддендума</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_Аддендумы/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	Если Статус = Перечисления.алк_СтатусыАддендума.Черновик тогда
		Движения.алк_Аддендумы.Записывать = Истина;
		Возврат;
	КонецЕсли;
	
	Движения.алк_Аддендумы.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.алк_Аддендумы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Аддендум = Ссылка;
		Движение.ИдентификаторТовара = ТекСтрокаТовары.ИдентификаторТовара;
		Движение.КПроизводству = ТекСтрокаТовары.Количество;
		Движение.КОтгрузке = ТекСтрокаТовары.Количество;
	КонецЦикла;

	Если Статус = Перечисления.алк_СтатусыАддендума.Закрыт тогда
		Движения.Записать();
		Запрос = новый запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_Аддендумы.Аддендум КАК Аддендум,
		|	алк_Аддендумы.ИдентификаторТовара КАК ИдентификаторТовара,
		|	алк_Аддендумы.КПроизводству КАК КПроизводству,
		|	алк_Аддендумы.КОтгрузке КАК КОтгрузке,
		|	алк_Аддендумы.Произведено КАК Произведено,
		|	алк_Аддендумы.Аддендум.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
		|ИЗ
		|	РегистрНакопления.алк_Аддендумы КАК алк_Аддендумы
		|ГДЕ
		|	алк_Аддендумы.Аддендум = &Аддендум
		|	И алк_Аддендумы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_АддендумыОстатки.Аддендум,
		|	алк_АддендумыОстатки.ИдентификаторТовара,
		|	алк_АддендумыОстатки.КПроизводствуОстаток,
		|	алк_АддендумыОстатки.КОтгрузкеОстаток,
		|	алк_АддендумыОстатки.ПроизведеноОстаток,
		|	алк_АддендумыОстатки.Аддендум.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|ИЗ
		|	РегистрНакопления.алк_Аддендумы.Остатки КАК алк_АддендумыОстатки
		|ГДЕ
		|	алк_АддендумыОстатки.Аддендум = &Аддендум");
		Запрос.УстановитьПараметр("Аддендум", Ссылка);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		Движения.алк_Аддендумы.Загрузить(РезультатЗапроса);
		Движения.алк_Аддендумы.Записывать = Истина;
	КонецЕсли;  
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Статус = Перечисления.алк_СтатусыАддендума.Черновик;
	Ответственный = Пользователи.ТекущийПользователь();
	НомерАддендума = "";
	ДатаАддендума = Дата(1,1,1);
	Комментарий = "";
	Документы.алк_Аддендумы.ЗаменаИдентификаторовТоваровПриКопировании(ЭтотОбъект);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Счетчик = 0;
	
	Пока Счетчик < СоставТоваров.Количество() Цикл
		
		Если Не ЗначениеЗаполнено(СоставТоваров[Счетчик].ИдентификаторТовара) тогда
			СоставТоваров.Удалить(СоставТоваров[Счетчик]);
		Иначе
			Счетчик = Счетчик + 1;
		КонецЕсли;
		
	КонецЦикла;
	Если Не ЗначениеЗаполнено(Ответственный) тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;  
	
	//проверка на пересечения в характеристиках   
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		
		НашлисьПересчения = Ложь;  
		
		Документы.алк_Аддендумы.ПоискПересеченийХарактеристик(СоставТоваров,Товары,НашлисьПересчения);   
		
		Если НашлисьПересчения Тогда  
			Отказ = Истина; 
			Возврат;
		КонецЕсли; 
		
	КонецЕсли; 
	//\\
	
КонецПроцедуры
